ЛАБ8/lab8/app/controllers/example_controller.rb

  def show
    @i = 0
    @summ = calc_sum
    if (result1 = Evklid.find_by(num1: @input1 = params[:num1], num2: @input2 = params[:num2]))
      @result_fin = result1.decoded_twins
    else
      result1 = Evklid.new(num1: @input1, num2: @input2)
      if result1.save
---
SELECT "evklids".* FROM "evklids" WHERE "evklids"."num1" = ? AND "evklids"."num2" = ? LIMIT ?  [["num1", 1], ["num2", 1], ["LIMIT", 1]]
INSERT INTO "evklids" ("num1", "num2", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)